export const days = ["ஞா", "தி", "செ", "பு", "வி", "வெ", "ச"];
export const partOfDay = ['பகல்', 'இரவு'];
export const shortPartOfDay = ['ப', 'இ'];
export const planets = [
    "சூரி", //0
    "சுக்", //1
    "புத", //2
    "சந்", //3
    "சனி", //4
    "குரு", //5
    "செ" //6
]
export const shortPlanets = {
    "சூரி": "சூ",
    "சுக்": "சு",
    "புத": "பு",
    "சந்": "சந்",
    "சனி": "ச",
    "குரு": "கு",
    "செ": "செ"
}
export const mapping = [0, 3, 6, 2, 5, 1, 4];


export const categories = [
    "கல்வி",  // 0
    "சுப காரியங்கள்", // 1
    "திருமணம்", // 2
    "சீமந்தம்", // 3
    "பெண் பார்ப்பது", // 4
    "பயணம்", // 5
    "வண்டி வாகனம்", // 6
    "ஆடை/ஆபரணம்", // 7
    "வீடு", // 8
    "நிலம்", // 9
    "வேலைக்கு விண்ணப்பிப்பது", // 10
    "மேலதிகாரிகளை சந்தித்தல்", // 11
    "பதவியேற்பது", // 12
    "வங்கிக் கணக்கு", // 13
    "விவசாயம்", // 14
    "மரக்கன்று", // 15
    "பண பரிமாற்றம்", // 16
    "கடனை அடைப்பதற்கு", // 17
    "அரசு காரியங்கள்/முயற்சிகள்", // 18
    "வழக்கு விஷயங்கள்", // 19
    "சகோதர/பங்காளி பிரச்சினைகள்", // 20
    "சொத்து பிரித்தல்", // 21
    "உயில்" // 22
];
export const categoryMapping = {
    'சூரி': { do: [18, 19, 11, 22], dont: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 12, 13, 14, 15, 16, 17, 20, 21], all: false }, // சூரி
    'சுக்': { do: [1, 8, 9, 6, 7, 4, 14, 15, 5, 16], dont: [], all: true }, // சுக்
    'புத': { do: [0, 1, 5], dont: [], all: true }, // புத
    'சந்': { do: [2, 3, 4, 12, 10, 1, 13], dont: [], all: true }, // சந்
    'சனி': { do: [17, 15], dont: [], all: false }, // சனி
    'குரு': { do: [1, 14, 7, 8, 9], dont: [], all: true }, // குரு
    'செ': { do: [9, 20, 21, 22], dont: [], all: false }  // செ
};