export const days = ["ஞா", "தி", "செ", "பு", "வி", "வெ", "ச"];
export const partOfDay = ['பகல்', 'இரவு'];
export const shortPartOfDay = ['ப', 'இ'];
export const planets = [
    "சூரி",
    "சுக்",
    "புத",
    "சந்",
    "சனி",
    "குரு",
    "செ"
]
export const shortPlanets = {
    "சூரி": "சூ",
    "சுக்": "சு",
    "புத": "பு",
    "சந்": "சந்",
    "சனி": "ச",
    "குரு": "கு",
    "செ": "செ"
}
export const mapping = [0, 3, 6, 2, 5, 1, 4];


export const categories = [
    "அரசு காரியங்கள்/முயற்சிகள்",
    "வழக்கு விஷயங்கள்",
    "மேலதிகாரிகளை சந்தித்தல்",
    "உயில்",
    "வீடு",
    "நிலம்",
    "வண்டி வாகனம்",
    "ஆடை/ஆபரணம்",
    "விவசாயம்",
    "பயணம்",
    "பண பரிமாற்றம்",
    "கல்வி",
    "திருமணம்",
    "சீமந்தம்",
    "பெண் பார்ப்பது",
    "பதவியேற்பது",
    "வேலைக்கு விண்ணப்பிப்பது",
    "வங்கிக் கணக்கு",
    "கடனை அடைப்பதற்கு",
    "மரக்கன்று",
    "சகோதர/பங்காளி பிரச்சினைகள்",
    "சொத்து பிரித்தல்"
];
export const catMapping = {

};